IMAGE_GENERATION_REQUEST_EXAMPLES: tuple = (
    "Создайте изображение красивой девушки на пляже",
    "Сгенерируйте изображение горной дороги в зимний день",
    "Создайте изображение красивой девушки на пляже",
    "Сгенерируйте изображение горной дороги в зимний день",
    "Создайте изображение ночного города с видом на звезды",
    "Создайте изображение суперкара на автостраде",
    "Создайте изображение детской комнаты с игрушками"
)

TEXT_GENERATION_REQUEST_EXAMPLES: tuple = (
    "Расскажите о последних новостях в мире технологий",
    "Напишите статью на русском языке о преимуществах использования возобновляемых источников энергии",
    "Расскажите о главных событиях в истории страны",
    "Напишите рецензию на русском языке на последний фильм, который вы посмотрели",
    "Расскажите о своем любимом городе",
    "Напиши статью на русском языке о вреде курения"
)

CODE_GENERATION_REQUEST_EXAMPLES: tuple = (
    "Напишите код на Python, который считывает данные из CSV-файла и выводит сумму всех чисел в столбце 'Total'",
    "Напишите Python функцию, которая принимает список слов и возвращает самое длинное слово в списке",
    "Напишите код на Python, который преобразует строку в формат JSON",
    "Напишите Python скрипт, который подключается к БД, выбирает данные из таблицы 'orders' и выводит их в терминал",
    "Напишите Python класс, который реализует стек и его основные методы (push, pop, peek)",
    "Напишите Python функцию, которая принимает список чисел и возвращает сумму всех чисел в списке"
    "Напишите Python класс, который представляет книгу, с методами для получения названия, автора и количества страниц",
    "Напишите Python скрипт, который ищет все файлы с расширением .txt в директории и выводит их имена на экран",
    "Напишите Python функцию, которая принимает строку и возвращает True, если строка является палиндромом, иначе False",
    "Напишите Python код, который соединяет два списка используя оператор +",
    "Напишите функцию для сортировки массива на Python с использованием алгоритма пузырька",
    "Создайте класс для работы с базой данных MySQL на Python",
    "Напишите скрипт для автоматического отправления электронной почты с использованием smtplib в Python"
)

EDIT_IMAGE_GENERATION_REQUEST_EXAMPLES: tuple = (
    "Измени фон на картинке, чтобы сделать ее более интересной",
    "Добавь тени на объекты на картинке, чтобы сделать ее более объемной",
    "Добавь рамку вокруг картинки, чтобы сделать ее более привлекательной",
    "Измени положение объектов на картинке, чтобы сделать ее более симметричной",
    "Добавь эффект зернистости на фоне картинки, чтобы сделать ее более аутентичной",
    "Удали объект с фото, чтобы сделать его более чистым",
    "Добавь объект на фото, чтобы сделать его более интересным",
    "Измени положение объекта на фото, чтобы сделать его более симметричным",
    "Измени размер объекта на фото",
    "Измени форму объекта на фото, чтобы сделать его более уникальным",
)
